Revit 2026 API

# TableSectionDataIsCellOverridden(Int32) Method

---

Indicates if the column is overridden or not.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsCellOverridden(
	int nCol
)
```
```vb
Public Function IsCellOverridden (
	nCol As Integer
) As Boolean
```
```cpp
public:
bool IsCellOverridden(
	int nCol
)
```
```fsharp
member IsCellOverridden :
        nCol : int -> bool
```

#### Parameters

nCol Int32

#### Return Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentException | The given column number nCol is invalid. |

#### Reference

TableSectionData Class

IsCellOverridden Overload

Autodesk.Revit.DB Namespace